dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32l4rx_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32L4Rx_gpio_v1_0_Modes.xml*/

#if !defined(_STM32L4Rx_PINMUX_H_)
# define _STM32L4Rx_PINMUX_H_

#define CAN1_RX_FUNC             0
#define CAN1_TX_FUNC             1
#define COMP1_OUT_FUNC           2
#define COMP2_OUT_FUNC           3
#define CRS_SYNC_FUNC            4
#define DCMI_D0_FUNC             5
#define DCMI_D1_FUNC             6
#define DCMI_D10_FUNC            7
#define DCMI_D11_FUNC            8
#define DCMI_D12_FUNC            9
#define DCMI_D13_FUNC            10
#define DCMI_D2_FUNC             11
#define DCMI_D3_FUNC             12
#define DCMI_D4_FUNC             13
#define DCMI_D5_FUNC             14
#define DCMI_D6_FUNC             15
#define DCMI_D7_FUNC             16
#define DCMI_D8_FUNC             17
#define DCMI_D9_FUNC             18
#define DCMI_HSYNC_FUNC          19
#define DCMI_PIXCLK_FUNC         20
#define DCMI_VSYNC_FUNC          21
#define DFSDM1_CKIN0_FUNC        22
#define DFSDM1_CKIN1_FUNC        23
#define DFSDM1_CKIN2_FUNC        24
#define DFSDM1_CKIN3_FUNC        25
#define DFSDM1_CKIN4_FUNC        26
#define DFSDM1_CKIN5_FUNC        27
#define DFSDM1_CKIN6_FUNC        28
#define DFSDM1_CKIN7_FUNC        29
#define DFSDM1_CKOUT_FUNC        30
#define DFSDM1_DATIN0_FUNC       31
#define DFSDM1_DATIN1_FUNC       32
#define DFSDM1_DATIN2_FUNC       33
#define DFSDM1_DATIN3_FUNC       34
#define DFSDM1_DATIN4_FUNC       35
#define DFSDM1_DATIN5_FUNC       36
#define DFSDM1_DATIN6_FUNC       37
#define DFSDM1_DATIN7_FUNC       38
#define DSIHOST_TE_FUNC          39
#define EVENTOUT_FUNC            40
#define FMC_A0_FUNC              41
#define FMC_A1_FUNC              42
#define FMC_A10_FUNC             43
#define FMC_A11_FUNC             44
#define FMC_A12_FUNC             45
#define FMC_A13_FUNC             46
#define FMC_A14_FUNC             47
#define FMC_A15_FUNC             48
#define FMC_A16_FUNC             49
#define FMC_A17_FUNC             50
#define FMC_A18_FUNC             51
#define FMC_A19_FUNC             52
#define FMC_A2_FUNC              53
#define FMC_A20_FUNC             54
#define FMC_A21_FUNC             55
#define FMC_A22_FUNC             56
#define FMC_A23_FUNC             57
#define FMC_A24_FUNC             58
#define FMC_A25_FUNC             59
#define FMC_A3_FUNC              60
#define FMC_A4_FUNC              61
#define FMC_A5_FUNC              62
#define FMC_A6_FUNC              63
#define FMC_A7_FUNC              64
#define FMC_A8_FUNC              65
#define FMC_A9_FUNC              66
#define FMC_CLK_FUNC             67
#define FMC_D0_FUNC              68
#define FMC_D1_FUNC              69
#define FMC_D10_FUNC             70
#define FMC_D11_FUNC             71
#define FMC_D12_FUNC             72
#define FMC_D13_FUNC             73
#define FMC_D14_FUNC             74
#define FMC_D15_FUNC             75
#define FMC_D2_FUNC              76
#define FMC_D3_FUNC              77
#define FMC_D4_FUNC              78
#define FMC_D5_FUNC              79
#define FMC_D6_FUNC              80
#define FMC_D7_FUNC              81
#define FMC_D8_FUNC              82
#define FMC_D9_FUNC              83
#define FMC_DA0_FUNC             84
#define FMC_DA1_FUNC             85
#define FMC_DA10_FUNC            86
#define FMC_DA11_FUNC            87
#define FMC_DA12_FUNC            88
#define FMC_DA13_FUNC            89
#define FMC_DA14_FUNC            90
#define FMC_DA15_FUNC            91
#define FMC_DA2_FUNC             92
#define FMC_DA3_FUNC             93
#define FMC_DA4_FUNC             94
#define FMC_DA5_FUNC             95
#define FMC_DA6_FUNC             96
#define FMC_DA7_FUNC             97
#define FMC_DA8_FUNC             98
#define FMC_DA9_FUNC             99
#define FMC_INT_FUNC             100
#define FMC_NBL0_FUNC            101
#define FMC_NBL1_FUNC            102
#define FMC_NCE_FUNC             103
#define FMC_NE1_FUNC             104
#define FMC_NE2_FUNC             105
#define FMC_NE3_FUNC             106
#define FMC_NE4_FUNC             107
#define FMC_NL_FUNC              108
#define FMC_NOE_FUNC             109
#define FMC_NWAIT_FUNC           110
#define FMC_NWE_FUNC             111
#define I2C1_SCL_FUNC            112
#define I2C1_SDA_FUNC            113
#define I2C1_SMBA_FUNC           114
#define I2C2_SCL_FUNC            115
#define I2C2_SDA_FUNC            116
#define I2C2_SMBA_FUNC           117
#define I2C3_SCL_FUNC            118
#define I2C3_SDA_FUNC            119
#define I2C3_SMBA_FUNC           120
#define I2C4_SCL_FUNC            121
#define I2C4_SDA_FUNC            122
#define I2C4_SMBA_FUNC           123
#define IR_OUT_FUNC              124
#define LPTIM1_ETR_FUNC          125
#define LPTIM1_IN1_FUNC          126
#define LPTIM1_IN2_FUNC          127
#define LPTIM1_OUT_FUNC          128
#define LPTIM2_ETR_FUNC          129
#define LPTIM2_IN1_FUNC          130
#define LPTIM2_OUT_FUNC          131
#define LPUART1_CTS_FUNC         132
#define LPUART1_DE_FUNC          133
#define LPUART1_RTS_FUNC         134
#define LPUART1_RX_FUNC          135
#define LPUART1_TX_FUNC          136
#define LTDC_B0_FUNC             137
#define LTDC_B1_FUNC             138
#define LTDC_B2_FUNC             139
#define LTDC_B3_FUNC             140
#define LTDC_B4_FUNC             141
#define LTDC_B5_FUNC             142
#define LTDC_B6_FUNC             143
#define LTDC_B7_FUNC             144
#define LTDC_CLK_FUNC            145
#define LTDC_DE_FUNC             146
#define LTDC_G0_FUNC             147
#define LTDC_G1_FUNC             148
#define LTDC_G2_FUNC             149
#define LTDC_G3_FUNC             150
#define LTDC_G4_FUNC             151
#define LTDC_G5_FUNC             152
#define LTDC_G6_FUNC             153
#define LTDC_G7_FUNC             154
#define LTDC_HSYNC_FUNC          155
#define LTDC_R0_FUNC             156
#define LTDC_R1_FUNC             157
#define LTDC_R2_FUNC             158
#define LTDC_R3_FUNC             159
#define LTDC_R4_FUNC             160
#define LTDC_R5_FUNC             161
#define LTDC_R6_FUNC             162
#define LTDC_R7_FUNC             163
#define LTDC_VSYNC_FUNC          164
#define OCTOSPIM_P1_CLK_FUNC     165
#define OCTOSPIM_P1_DQS_FUNC     166
#define OCTOSPIM_P1_IO0_FUNC     167
#define OCTOSPIM_P1_IO1_FUNC     168
#define OCTOSPIM_P1_IO2_FUNC     169
#define OCTOSPIM_P1_IO3_FUNC     170
#define OCTOSPIM_P1_IO4_FUNC     171
#define OCTOSPIM_P1_IO5_FUNC     172
#define OCTOSPIM_P1_IO6_FUNC     173
#define OCTOSPIM_P1_IO7_FUNC     174
#define OCTOSPIM_P1_NCS_FUNC     175
#define OCTOSPIM_P2_CLK_FUNC     176
#define OCTOSPIM_P2_DQS_FUNC     177
#define OCTOSPIM_P2_IO0_FUNC     178
#define OCTOSPIM_P2_IO1_FUNC     179
#define OCTOSPIM_P2_IO2_FUNC     180
#define OCTOSPIM_P2_IO3_FUNC     181
#define OCTOSPIM_P2_IO4_FUNC     182
#define OCTOSPIM_P2_IO5_FUNC     183
#define OCTOSPIM_P2_IO6_FUNC     184
#define OCTOSPIM_P2_IO7_FUNC     185
#define OCTOSPIM_P2_NCS_FUNC     186
#define RCC_MCO_FUNC             187
#define RTC_OUT_ALARM_FUNC       188
#define RTC_OUT_CALIB_FUNC       189
#define RTC_REFIN_FUNC           190
#define SAI1_CK1_FUNC            191
#define SAI1_CK2_FUNC            192
#define SAI1_D1_FUNC             193
#define SAI1_D2_FUNC             194
#define SAI1_D3_FUNC             195
#define SAI1_EXTCLK_FUNC         196
#define SAI1_FS_A_FUNC           197
#define SAI1_FS_B_FUNC           198
#define SAI1_MCLK_A_FUNC         199
#define SAI1_MCLK_B_FUNC         200
#define SAI1_SCK_A_FUNC          201
#define SAI1_SCK_B_FUNC          202
#define SAI1_SD_A_FUNC           203
#define SAI1_SD_B_FUNC           204
#define SAI2_EXTCLK_FUNC         205
#define SAI2_FS_A_FUNC           206
#define SAI2_FS_B_FUNC           207
#define SAI2_MCLK_A_FUNC         208
#define SAI2_MCLK_B_FUNC         209
#define SAI2_SCK_A_FUNC          210
#define SAI2_SCK_B_FUNC          211
#define SAI2_SD_A_FUNC           212
#define SAI2_SD_B_FUNC           213
#define SDMMC1_CDIR_FUNC         214
#define SDMMC1_CK_FUNC           215
#define SDMMC1_CKIN_FUNC         216
#define SDMMC1_CMD_FUNC          217
#define SDMMC1_D0_FUNC           218
#define SDMMC1_D0DIR_FUNC        219
#define SDMMC1_D1_FUNC           220
#define SDMMC1_D123DIR_FUNC      221
#define SDMMC1_D2_FUNC           222
#define SDMMC1_D3_FUNC           223
#define SDMMC1_D4_FUNC           224
#define SDMMC1_D5_FUNC           225
#define SDMMC1_D6_FUNC           226
#define SDMMC1_D7_FUNC           227
#define SPI1_MISO_FUNC           228
#define SPI1_MOSI_FUNC           229
#define SPI1_NSS_FUNC            230
#define SPI1_SCK_FUNC            231
#define SPI2_MISO_FUNC           232
#define SPI2_MOSI_FUNC           233
#define SPI2_NSS_FUNC            234
#define SPI2_SCK_FUNC            235
#define SPI3_MISO_FUNC           236
#define SPI3_MOSI_FUNC           237
#define SPI3_NSS_FUNC            238
#define SPI3_SCK_FUNC            239
#define SYS_JTCK_SWCLK_FUNC      240
#define SYS_JTDI_FUNC            241
#define SYS_JTDO_SWO_FUNC        242
#define SYS_JTMS_SWDIO_FUNC      243
#define SYS_JTRST_FUNC           244
#define SYS_TRACECLK_FUNC        245
#define SYS_TRACED0_FUNC         246
#define SYS_TRACED1_FUNC         247
#define SYS_TRACED2_FUNC         248
#define SYS_TRACED3_FUNC         249
#define TIM15_BKIN_FUNC          250
#define TIM15_CH1_FUNC           251
#define TIM15_CH1N_FUNC          252
#define TIM15_CH2_FUNC           253
#define TIM16_BKIN_FUNC          254
#define TIM16_CH1_FUNC           255
#define TIM16_CH1N_FUNC          256
#define TIM17_BKIN_FUNC          257
#define TIM17_CH1_FUNC           258
#define TIM17_CH1N_FUNC          259
#define TIM1_BKIN_FUNC           260
#define TIM1_BKIN2_FUNC          261
#define TIM1_CH1_FUNC            262
#define TIM1_CH1N_FUNC           263
#define TIM1_CH2_FUNC            264
#define TIM1_CH2N_FUNC           265
#define TIM1_CH3_FUNC            266
#define TIM1_CH3N_FUNC           267
#define TIM1_CH4_FUNC            268
#define TIM1_ETR_FUNC            269
#define TIM2_CH1_FUNC            270
#define TIM2_CH2_FUNC            271
#define TIM2_CH3_FUNC            272
#define TIM2_CH4_FUNC            273
#define TIM2_ETR_FUNC            274
#define TIM3_CH1_FUNC            275
#define TIM3_CH2_FUNC            276
#define TIM3_CH3_FUNC            277
#define TIM3_CH4_FUNC            278
#define TIM3_ETR_FUNC            279
#define TIM4_CH1_FUNC            280
#define TIM4_CH2_FUNC            281
#define TIM4_CH3_FUNC            282
#define TIM4_CH4_FUNC            283
#define TIM4_ETR_FUNC            284
#define TIM5_CH1_FUNC            285
#define TIM5_CH2_FUNC            286
#define TIM5_CH3_FUNC            287
#define TIM5_CH4_FUNC            288
#define TIM5_ETR_FUNC            289
#define TIM8_BKIN_FUNC           290
#define TIM8_BKIN2_FUNC          291
#define TIM8_CH1_FUNC            292
#define TIM8_CH1N_FUNC           293
#define TIM8_CH2_FUNC            294
#define TIM8_CH2N_FUNC           295
#define TIM8_CH3_FUNC            296
#define TIM8_CH3N_FUNC           297
#define TIM8_CH4_FUNC            298
#define TIM8_ETR_FUNC            299
#define TSC_G1_IO1_FUNC          300
#define TSC_G1_IO2_FUNC          301
#define TSC_G1_IO3_FUNC          302
#define TSC_G1_IO4_FUNC          303
#define TSC_G2_IO1_FUNC          304
#define TSC_G2_IO2_FUNC          305
#define TSC_G2_IO3_FUNC          306
#define TSC_G2_IO4_FUNC          307
#define TSC_G3_IO1_FUNC          308
#define TSC_G3_IO2_FUNC          309
#define TSC_G3_IO3_FUNC          310
#define TSC_G3_IO4_FUNC          311
#define TSC_G4_IO1_FUNC          312
#define TSC_G4_IO2_FUNC          313
#define TSC_G4_IO3_FUNC          314
#define TSC_G4_IO4_FUNC          315
#define TSC_G5_IO1_FUNC          316
#define TSC_G5_IO2_FUNC          317
#define TSC_G5_IO3_FUNC          318
#define TSC_G5_IO4_FUNC          319
#define TSC_G6_IO1_FUNC          320
#define TSC_G6_IO2_FUNC          321
#define TSC_G6_IO3_FUNC          322
#define TSC_G6_IO4_FUNC          323
#define TSC_G7_IO1_FUNC          324
#define TSC_G7_IO2_FUNC          325
#define TSC_G7_IO3_FUNC          326
#define TSC_G7_IO4_FUNC          327
#define TSC_G8_IO1_FUNC          328
#define TSC_G8_IO2_FUNC          329
#define TSC_G8_IO3_FUNC          330
#define TSC_G8_IO4_FUNC          331
#define TSC_SYNC_FUNC            332
#define UART4_CTS_FUNC           333
#define UART4_DE_FUNC            334
#define UART4_RTS_FUNC           335
#define UART4_RX_FUNC            336
#define UART4_TX_FUNC            337
#define UART5_CTS_FUNC           338
#define UART5_DE_FUNC            339
#define UART5_RTS_FUNC           340
#define UART5_RX_FUNC            341
#define UART5_TX_FUNC            342
#define USART1_CK_FUNC           343
#define UART1_CK_FUNC            343
#define USART1_CTS_FUNC          344
#define UART1_CTS_FUNC           344
#define USART1_DE_FUNC           345
#define UART1_DE_FUNC            345
#define USART1_NSS_FUNC          346
#define UART1_NSS_FUNC           346
#define USART1_RTS_FUNC          347
#define UART1_RTS_FUNC           347
#define USART1_RX_FUNC           348
#define UART1_RX_FUNC            348
#define USART1_TX_FUNC           349
#define UART1_TX_FUNC            349
#define USART2_CK_FUNC           350
#define UART2_CK_FUNC            350
#define USART2_CTS_FUNC          351
#define UART2_CTS_FUNC           351
#define USART2_DE_FUNC           352
#define UART2_DE_FUNC            352
#define USART2_NSS_FUNC          353
#define UART2_NSS_FUNC           353
#define USART2_RTS_FUNC          354
#define UART2_RTS_FUNC           354
#define USART2_RX_FUNC           355
#define UART2_RX_FUNC            355
#define USART2_TX_FUNC           356
#define UART2_TX_FUNC            356
#define USART3_CK_FUNC           357
#define UART3_CK_FUNC            357
#define USART3_CTS_FUNC          358
#define UART3_CTS_FUNC           358
#define USART3_DE_FUNC           359
#define UART3_DE_FUNC            359
#define USART3_NSS_FUNC          360
#define UART3_NSS_FUNC           360
#define USART3_RTS_FUNC          361
#define UART3_RTS_FUNC           361
#define USART3_RX_FUNC           362
#define UART3_RX_FUNC            362
#define USART3_TX_FUNC           363
#define UART3_TX_FUNC            363
#define USB_OTG_FS_DM_FUNC       364
#define USB_OTG_FS_DP_FUNC       365
#define USB_OTG_FS_ID_FUNC       366
#define USB_OTG_FS_NOE_FUNC      367
#define USB_OTG_FS_SOF_FUNC      368

